{
  "TAB__ALL": "All",
  "TAB__WORK": "Professional Projects",
  "TAB__SIDE_PROJECT": "Side Project",
  "CURSOR__TEXT": "Visit ↗",
  "LOADING__NAME": "ROSE WANG",
  "LOADING__POSITION": "Front-End Engineer / Software Engineer",
  "ABOUT__NAME": "ROSE WANG",
  "ABOUT__POSITION": "Front-End Engineer / Software Engineer",
  "ABOUT__INTRODUCE": "Focused on creating visually engaging and finely interactive web experiences. Transitioned from full-stack to frontend development, bringing over 6 years of software development experience. Skilled at blending animation with user experience to deliver high-quality work that balances technology and aesthetics.",
  "ABOUT__SKILLS": "SKILLS",
  "ABOUT__EXPERIENCE": "EXPERIENCE",
  "ABOUT__WORKS": "WORKS",
  "SKILLS__TITLE": "Skills",
  "SKILLS__DESCRIPTION": "Proficient in the Vue.js ecosystem with experience in SSR development using Nuxt.js. Continuously learning front-end technologies such as React.js. Skilled in animation libraries like GSAP and capable with design tools (Figma, Photoshop, Illustrator). Strong full-stack background with experience in PHP, Java, and C#, and hands-on exploration of blockchain by writing and deploying Solidity smart contracts. Experienced in iOS app development and publication, and have built various side projects including Chrome Extensions, LINE LIFF, and Electron.js apps.",
  "SKILLS__ITEMS_1__NAME": "Front-End",
  "SKILLS__ITEMS_2__NAME": "Back-End",
  "SKILLS__ITEMS_3__NAME": "Team Collaboration / Tools",
  "SKILLS__ITEMS_4__NAME": "Other",
  "SKILLS__ITEMS_1__SKILL_1": "<span>Vue.js / Nuxt.js (SSR)</span>",
  "SKILLS__ITEMS_1__SKILL_2": "<span>Pinia / Vuex / VueUse</span>",
  "SKILLS__ITEMS_1__SKILL_3": "<span>RWD / In-APP-Webview</span>",
  "SKILLS__ITEMS_1__SKILL_4": "<span>SASS (SCSS) / Tailwind / BEM</span>",
  "SKILLS__ITEMS_1__SKILL_5": "<span>Javascript / TypeScript</span>",
  "SKILLS__ITEMS_1__SKILL_6": "Cypress",
  "SKILLS__ITEMS_1__SKILL_7": "Vite",
  "SKILLS__ITEMS_1__SKILL_8": "Webpack",
  "SKILLS__ITEMS_1__SKILL_9": "Yarn / bun / npm",
  "SKILLS__ITEMS_1__SKILL_10": "Eslint / Prettier",
  "SKILLS__ITEMS_1__SKILL_11": "SEO",
  "SKILLS__ITEMS_1__SKILL_12": "Electron.js",
  "SKILLS__ITEMS_1__SKILL_13": "LINE Front-end Framework (LIFF)",
  "SKILLS__ITEMS_1__SKILL_14": "Google Chrome Extension",
  "SKILLS__ITEMS_1__SKILL_15": "Element UI",
  "SKILLS__ITEMS_1__SKILL_16": "jQuery / Bootstrap",
  "SKILLS__ITEMS_2__SKILL_1": "<span>Node.js (Express)</span>",
  "SKILLS__ITEMS_2__SKILL_2": "PHP (Laravel)",
  "SKILLS__ITEMS_2__SKILL_3": "mySQL",
  "SKILLS__ITEMS_2__SKILL_4": "PostgreSQL",
  "SKILLS__ITEMS_2__SKILL_5": "API Development",
  "SKILLS__ITEMS_2__SKILL_6": "System & Database Design",
  "SKILLS__ITEMS_3__SKILL_1": "Git (Github / Gitlab)",
  "SKILLS__ITEMS_3__SKILL_2": "<span>Figma</span>",
  "SKILLS__ITEMS_3__SKILL_3": "Zeplin / Sketch",
  "SKILLS__ITEMS_3__SKILL_4": "Jira",
  "SKILLS__ITEMS_3__SKILL_5": "Slack",
  "SKILLS__ITEMS_3__SKILL_6": "Browser Stack",
  "SKILLS__ITEMS_3__SKILL_7": "Storybook",
  "SKILLS__ITEMS_4__SKILL_1": "Photoshop / Illustrator",
  "SKILLS__ITEMS_4__SKILL_2": "Web3.js / Solidity (Blockchain)",
  "SKILLS__ITEMS_4__SKILL_3": "Phaser.js",
  "SKILLS__ITEMS_4__SKILL_4": "Chart.js",
  "SKILLS__ITEMS_4__SKILL_5": "<span>GSAP</span>",
  "SKILLS__ITEMS_4__SKILL_6": "<span>Matter.js</span>",
  "SKILLS__ITEMS_4__SKILL_7": "iOS App (Swift)",
  "EXPERIENCE__TITLE": "EXPERIENCE",
  "EXPERIENCE__DESCRIPTION": "Over 6 years of software development experience, starting as a full-stack developer and gradually focusing on frontend engineering. Skilled in system architecture, cross-functional collaboration, and the Vue.js ecosystem. Participated in large-scale enterprise system maintenance as well as leading end-to-end product development in startup teams. Experienced in both remote and on-site workflows with flexible adaptability to different team environments and requirements.",
  "EXPERIENCE__1__POSITION": "Frontend Engineer",
  "EXPERIENCE__1__COMPANY": "Garena Online Private Limited",
  "EXPERIENCE__1__PROJECT_1": "Developed marketing campaign sites, pre-registration pages, and high-interaction in-game web events for several well-known mobile games (e.g., Arena of Valor, Moonlight Blade M, Black Clover M) using Nuxt.js and Vue.js. Also responsible for frontend development and maintenance of internal admin systems.",
  "EXPERIENCE__1__PROJECT_2": "Optimized web performance, implemented responsive design, ensured In-App WebView compatibility, integrated SEO strategies, and maintained cross-device support.",
  "EXPERIENCE__1__PROJECT_3": "Collaborated closely with UI/UX designers, backend developers, QA, and PMs—handled everything from API integration to cross-functional technical planning to ensure on-time project delivery.",
  "EXPERIENCE__1__PROJECT_4": "Managed exception handling and error monitoring in high-traffic environments using Sentry to quickly respond to issues and deploy fixes.",
  "EXPERIENCE__1__PROJECT_5": "Enhanced overall code quality and maintainability through active participation in code reviews, development of shared UI components (via Storybook), and creation of internal documentation and Cookiecutter-based project templates.",
  "EXPERIENCE__1__PROJECT_6": "Contributed to team knowledge-sharing through internal frontend tech talks, book study sessions, and experimentation with new tools. Also participated in external tech community events, such as the {Laravel x Vue} Conf Taiwan 2023.",
  "EXPERIENCE__1__TAGS_1": "Nuxt.js",
  "EXPERIENCE__1__TAGS_2": "Vue.js",
  "EXPERIENCE__1__TAGS_3": "TypeScript",
  "EXPERIENCE__1__TAGS_4": "CSS（SCSS）",
  "EXPERIENCE__1__TAGS_5": "Vite",
  "EXPERIENCE__1__TAGS_6": "Webpack",
  "EXPERIENCE__1__TAGS_7": "SSR",
  "EXPERIENCE__1__TAGS_8": "RWD",
  "EXPERIENCE__1__TAGS_9": "WebView",
  "EXPERIENCE__1__TAGS_10": "Eslint",
  "EXPERIENCE__1__TAGS_11": "Prettier",
  "EXPERIENCE__1__TAGS_12": "Storybook",
  "EXPERIENCE__1__TAGS_13": "cookie-cutter（Django）",
  "EXPERIENCE__1__TAGS_14": "Jira",
  "EXPERIENCE__1__TAGS_15": "Git",
  "EXPERIENCE__1__TAGS_16": "Code Review",
  "EXPERIENCE__1__TAGS_17": "Sentry",
  "EXPERIENCE__1__TAGS_18": "Browser Stack",
  "EXPERIENCE__1__TAGS_19": "跨裝置相容性調整",
  "EXPERIENCE__1__TAGS_20": "百萬用戶效能優化",
  "EXPERIENCE__1__TAGS_21": "SEO",
  "EXPERIENCE__1__TAGS_22": "Google Analytics",
  "EXPERIENCE__1__TAGS_23": "Google Conversion",
  "EXPERIENCE__1__TAGS_24": "Meta Pixel",
  "EXPERIENCE__1__TAGS_25": "TikTok Pixel",
  "EXPERIENCE__2__POSITION": "Full-Stack Engineer → Frontend Engineer (Remote)",
  "EXPERIENCE__2__COMPANY": "ZIMI TECHNOLOGY CO., LTD.",
  "EXPERIENCE__2__PROJECT_1": "Developed both frontend and partial backend features for various projects using Nuxt.js, Vue.js, and Laravel (PHP), including e-commerce platforms, blockchain trading systems, smart vending machines, and internal admin tools.",
  "EXPERIENCE__2__PROJECT_2": "Researched and built blockchain applications, wrote Ethereum smart contracts (Solidity), developed trading APIs, and integrated Web3.js with crypto wallet functionality.",
  "EXPERIENCE__2__PROJECT_3": "Collaborated with backend engineers and QA, and implemented UI based on Zeplin and Sketch design specs, adjusting RWD and UX flows according to business requirements.",
  "EXPERIENCE__2__PROJECT_4": "Integrated third-party payment APIs, set up Google Analytics and conversion tracking, and implemented backend event tracking logic.",
  "EXPERIENCE__2__PROJECT_5": "Involved in technical planning from scratch, participated in cross-functional discussions, and contributed to long-term maintenance and feature optimization.",
  "EXPERIENCE__2__TAGS_1": "Vue.js",
  "EXPERIENCE__2__TAGS_2": "Nuxt.js",
  "EXPERIENCE__2__TAGS_3": "PHP",
  "EXPERIENCE__2__TAGS_4": "Laravel",
  "EXPERIENCE__2__TAGS_5": "Web3.js",
  "EXPERIENCE__2__TAGS_6": "Solidity",
  "EXPERIENCE__2__TAGS_7": "SCSS",
  "EXPERIENCE__2__TAGS_8": "Bootstrap",
  "EXPERIENCE__2__TAGS_9": "jQuery",
  "EXPERIENCE__2__TAGS_10": "Google Analytics",
  "EXPERIENCE__2__TAGS_11": "Google Conversion",
  "EXPERIENCE__2__TAGS_12": "Git",
  "EXPERIENCE__2__TAGS_13": "Sketch",
  "EXPERIENCE__2__TAGS_14": "Zeplin",
  "EXPERIENCE__3__POSITION": "Frontend Engineer (Freelance/Remote)",
  "EXPERIENCE__3__COMPANY": "freelancer",
  "EXPERIENCE__3__PROJECT_1": "Independently managed freelance projects from end to end, including client negotiation, requirements gathering, project planning, scheduling, delivery, and closure.",
  "EXPERIENCE__3__PROJECT_2": "Developed customized admin systems, handling frontend UI and feature implementation tailored to client workflows.",
  "EXPERIENCE__3__PROJECT_3": "Modified and optimized Google Blogger templates based on client needs, improving layout structure and functional logic.",
  "EXPERIENCE__3__PROJECT_4": "Responsible for responsive web design and frontend development to ensure a consistent user experience across devices.",
  "EXPERIENCE__3__PROJECT_5": "Collaborated with backend engineers to integrate APIs and implement dynamic data presentation and interaction.",
  "EXPERIENCE__3__TAGS_1": "Vue.js",
  "EXPERIENCE__3__TAGS_2": "JavaScript",
  "EXPERIENCE__3__TAGS_3": "CSS",
  "EXPERIENCE__3__TAGS_4": "jQuery",
  "EXPERIENCE__3__TAGS_5": "Ajax",
  "EXPERIENCE__3__TAGS_6": "RWD",
  "EXPERIENCE__3__TAGS_7": "API 串接",
  "EXPERIENCE__3__TAGS_8": "Blogger 模板客製",
  "EXPERIENCE__3__TAGS_9": "接案經驗",
  "EXPERIENCE__3__TAGS_10": "專案規劃",
  "EXPERIENCE__4__POSITION": "Full-Stack Engineer",
  "EXPERIENCE__4__COMPANY": "U-ARK Technology Co. Ltd.",
  "EXPERIENCE__4__PROJECT_1": "Developed ERP systems, long-term care platforms, and medical device companion apps, covering both enterprise and healthcare field applications.",
  "EXPERIENCE__4__PROJECT_2": "Responsible for full-stack development, including database schema design, backend API development, and frontend implementation.",
  "EXPERIENCE__4__PROJECT_3": "Built responsive web interfaces to ensure a seamless experience across different devices and screen sizes.",
  "EXPERIENCE__4__PROJECT_4": "Led technical planning from the ground up, participated in cross-departmental coordination, and continued maintaining and optimizing system functionality.",
  "EXPERIENCE__4__PROJECT_5": "Engaged directly with frontline clients to gather requirements and translate real-world needs into viable technical solutions.",
  "EXPERIENCE__4__TAGS_1": "PHP",
  "EXPERIENCE__4__TAGS_2": "Laravel",
  "EXPERIENCE__4__TAGS_3": "C#",
  "EXPERIENCE__4__TAGS_4": ".NET Framework",
  "EXPERIENCE__4__TAGS_5": "JavaScript",
  "EXPERIENCE__4__TAGS_6": "CSS",
  "EXPERIENCE__4__TAGS_7": "jQuery",
  "EXPERIENCE__4__TAGS_8": "Ajax",
  "EXPERIENCE__4__TAGS_9": "RWD",
  "EXPERIENCE__4__TAGS_10": "全端開發",
  "EXPERIENCE__4__TAGS_11": "資料庫設計",
  "EXPERIENCE__4__TAGS_12": "API 開發",
  "EXPERIENCE__4__TAGS_13": "跨部門協作",
  "EXPERIENCE__4__TAGS_14": "需求訪談",
  "EXPERIENCE__5__POSITION": "Software Development Intern",
  "EXPERIENCE__5__COMPANY": "Cathay Life Insurance Co., Ltd.",
  "EXPERIENCE__5__PROJECT_1": "Developed internal tools, a financial backend system, and a meal ordering platform to support daily operations and improve workflow efficiency.",
  "EXPERIENCE__5__PROJECT_2": "Implemented and maintained backend modules based on requirements specified by SA/SD via work orders.",
  "EXPERIENCE__5__PROJECT_3": "Built and integrated backend APIs, handling data processing logic and flow implementation.",
  "EXPERIENCE__5__PROJECT_4": "Responsible for frontend UI layout and API integration to enable interactive data functionality.",
  "EXPERIENCE__5__TAGS_1": "Java",
  "EXPERIENCE__5__TAGS_2": "JSP",
  "EXPERIENCE__5__TAGS_3": "JavaScript",
  "EXPERIENCE__5__TAGS_4": "jQuery",
  "EXPERIENCE__5__TAGS_5": "CSS",
  "EXPERIENCE__5__TAGS_6": "Ajax",
  "EXPERIENCE__5__TAGS_7": "後台系統",
  "EXPERIENCE__5__TAGS_8": "API 開發",
  "EXPERIENCE__5__TAGS_9": "系統模組化",
  "EXPERIENCE__6__POSITION": "Bachelor of Information Management",
  "EXPERIENCE__6__COMPANY": "Tunghai University",
  "EXPERIENCE__6__PROJECT_1": "Completed a variety of computer science and business-related courses during university, building a strong foundation in programming and logical thinking.",
  "EXPERIENCE__6__PROJECT_2": "Core coursework included: Programming, Database Design, Statistics, Discrete Mathematics, Accounting, Information Management, and Calculus.",
  "EXPERIENCE__6__TAGS_1": "Python",
  "EXPERIENCE__6__TAGS_2": "Java",
  "EXPERIENCE__6__TAGS_3": "JavaScript",
  "EXPERIENCE__6__TAGS_4": "PHP",
  "EXPERIENCE__6__TAGS_5": "C",
  "EXPERIENCE__6__TAGS_6": "C#",
  "EXPERIENCE__6__TAGS_7": "Database Design",
  "WORKS__DEMO_LINKS": "Project Website",
  "WORKS__TITLE": "WORKS",
  "WORKS__DESCRIPTION": "Besides professional development roles, I am passionate about exploring new technologies and transforming real-life pain points into side projects. With backend experience, I can independently complete full-stack development, from UI/UX design to functional implementation, creating projects with technical depth and a great user experience. I have a strong interest in design and visual aesthetics; although not a professional designer, I pay close attention to details and overall visual harmony, aiming to strike the best balance between user experience and visual effects.",
  "WORKS__PROJECTS__NAME_25101": "Game Marketing Website",
  "WORKS__PROJECTS__DATE_25101": "2022–2025",
  "WORKS__PROJECTS__DESCRIPTION_25101": "Worked at Garena Singapore from 2022 to 2025, responsible for developing and maintaining multilingual marketing websites for multiple games. Projects covered main game visuals, pre-registration events, announcements, social sharing, and incorporated interactive visual effects to enhance player engagement. Participated in all stages from requirements discussion, front-end and back-end integration, UI implementation to subsequent maintenance and updates, helping create a website experience with strong brand identity and marketing impact.",
  "WORKS__PROJECTS__SKILLS_25101_1": "Developed marketing websites for games such as 'DeltaForce' and 'Fullmetal Alchemist M'.",
  "WORKS__PROJECTS__SKILLS_25101_2": "Used Nuxt.js (Vue SSR framework) for front-end development, building SEO-friendly and high-performance website architecture.",
  "WORKS__PROJECTS__SKILLS_25101_3": "Implemented responsive RWD pages with modular styles using SASS (SCSS), and introduced TypeScript to improve code stability and maintainability.",
  "WORKS__PROJECTS__SKILLS_25101_4": "Integrated i18n internationalization plugin to support multilingual switching for global users.",
  "WORKS__PROJECTS__SKILLS_25101_5": "Involved in ongoing version maintenance and new feature development to continuously improve user experience and product stability.",
  "WORKS__PROJECTS__SKILLS_25101_6": "Cross-department collaboration: discussed requirements and technical feasibility with international game operations teams and delivered projects according to workflow tickets.",
  "WORKS__PROJECTS__SKILLS_25101_7": "Collaborated with other front-end engineers for development and code review, discussing best implementation practices to continuously optimize code quality and maintain team consistency.",
  "WORKS__PROJECTS__SKILLS_25101_8": "Cooperated with back-end engineers on API design and integration to ensure smooth front-end and back-end data flow.",
  "WORKS__PROJECTS__SKILLS_25101_9": "Worked closely with designers to convert UI designs into code, implementing animation effects and sound trigger logic.",
  "WORKS__PROJECTS__SKILLS_25101_10": "Collaborated with marketing to integrate and configure tracking codes such as GA, Google Conversion, Meta Pixel, and TikTok Pixel.",
  "WORKS__PROJECTS__SKILLS_25101_11": "Cooperated with QA engineers to troubleshoot and optimize issues based on testing feedback, ensuring stable functionality and smooth experience.",
  "WORKS__PROJECTS__SKILLS_25101_12": "Wrote and maintained development documentation to enhance internal team knowledge sharing.",
  "WORKS__PROJECTS__TAGS_25101_1": "Nuxt.js (Vue)",
  "WORKS__PROJECTS__TAGS_25101_2": "Typescript",
  "WORKS__PROJECTS__TAGS_25101_3": "SASS (SCSS)",
  "WORKS__PROJECTS__TAGS_25101_4": "Vite",
  "WORKS__PROJECTS__TAGS_25101_5": "i18n",
  "WORKS__PROJECTS__TAGS_25101_6": "SSR",
  "WORKS__PROJECTS__TAGS_25101_7": "SEO",
  "WORKS__PROJECTS__TAGS_25101_8": "Google Analytics",
  "WORKS__PROJECTS__TAGS_25101_9": "Google Conversion",
  "WORKS__PROJECTS__TAGS_25101_10": "Meta Pixel",
  "WORKS__PROJECTS__TAGS_25101_11": "TikTok Pixel",
  "WORKS__PROJECTS__NAME_25102": "Mobile Game In-App WebView Interactive Pages",
  "WORKS__PROJECTS__DATE_25102": "2022–2025",
  "WORKS__PROJECTS__DESCRIPTION_25102": "Employed at Garena (Singapore) from 2022 to 2025, responsible for developing and maintaining In-App WebView event pages for multiple mobile games. Projects included multilingual support, visual effects, and interactive game designs. Content involved revenue-driven event pages, IP collaborations, in-game event lobbies, tournament pages, and player surveys, helping increase player retention and user engagement.",
  "WORKS__PROJECTS__SKILLS_25102_1": "Developed interactive web pages inside mobile games including 'Arena of Valor', 'Moonlight Blade M', 'Call of Duty: Mobile', 'Black Clover M: Path of the Magic Emperor', 'Dawn Awakening', 'Fullmetal Alchemist M', and others.",
  "WORKS__PROJECTS__SKILLS_25102_2": "Used Vue.js to develop In-App WebView event pages for mobile games, optimized for cross-device compatibility on iOS and Android platforms.",
  "WORKS__PROJECTS__SKILLS_25102_3": "Implemented responsive RWD web pages, modularized styles using SASS (SCSS), and adopted TypeScript to enhance code stability and maintainability.",
  "WORKS__PROJECTS__SKILLS_25102_4": "Integrated i18n internationalization plugin to enable multilingual switching for global users.",
  "WORKS__PROJECTS__SKILLS_25102_5": "Participated in version maintenance and new feature development to continuously improve user experience and product stability.",
  "WORKS__PROJECTS__SKILLS_25102_6": "Collaborated cross-departmentally with multinational game operations teams to discuss requirements and technical feasibility, delivering projects according to task workflows.",
  "WORKS__PROJECTS__SKILLS_25102_7": "Worked with other front-end engineers to develop and conduct code reviews, discussing best practices to continuously optimize code quality and maintain team development consistency.",
  "WORKS__PROJECTS__SKILLS_25102_8": "Collaborated with back-end engineers on API design and integration to ensure smooth data flow between front-end and back-end.",
  "WORKS__PROJECTS__SKILLS_25102_9": "Worked closely with designers to slice UI designs and implement animation effects and sound trigger logic.",
  "WORKS__PROJECTS__SKILLS_25102_10": "Integrated and configured Google Analytics tracking codes in cooperation with the marketing department.",
  "WORKS__PROJECTS__SKILLS_25102_11": "Collaborated with QA engineers to troubleshoot and optimize issues based on testing feedback, ensuring stable functionality and smooth user experience.",
  "WORKS__PROJECTS__SKILLS_25102_12": "Supported hundreds of thousands of players with heavy real-time concurrent browsing and interactions during peak event periods, emphasizing performance and stability in development.",
  "WORKS__PROJECTS__SKILLS_25102_13": "Adopted lazy loading, pagination, and batch request strategies to efficiently optimize data rendering and user operation experience.",
  "WORKS__PROJECTS__SKILLS_25102_14": "Integrated WebSocket real-time connection technology to support live interaction and gameplay mechanics on event pages, enhancing participation and fun.",
  "WORKS__PROJECTS__SKILLS_25102_15": "Wrote and maintained development documentation to improve internal team knowledge sharing.",
  "WORKS__PROJECTS__TAGS_25102_1": "Vue.js",
  "WORKS__PROJECTS__TAGS_25102_2": "Vue3, Vue2",
  "WORKS__PROJECTS__TAGS_25102_3": "TypeScript",
  "WORKS__PROJECTS__TAGS_25102_4": "SASS (SCSS)",
  "WORKS__PROJECTS__TAGS_25102_5": "Vite",
  "WORKS__PROJECTS__TAGS_25102_6": "In-App WebView",
  "WORKS__PROJECTS__TAGS_25102_7": "i18n",
  "WORKS__PROJECTS__TAGS_25102_8": "Google Analytics",
  "WORKS__PROJECTS__NAME_22101": "Leisure Shopping (E-commerce Platform)",
  "WORKS__PROJECTS__DATE_22101": "2019–2022",
  "WORKS__PROJECTS__DESCRIPTION_22101": "Worked at Ziyi Technology Co., Ltd. from 2019 to 2022, responsible for front-end development of the company’s e-commerce platform, covering full site development from scratch to launch and subsequent maintenance. Main tasks included homepage, shopping cart and checkout system, product display, product categorization, promotional activities, and SEO optimization to increase search engine exposure.",
  "WORKS__PROJECTS__SKILLS_22101_1": "Developed with Nuxt.js and Vue SSR framework, providing high-performance server-side rendering (SSR) solutions and optimized SEO for better search ranking.",
  "WORKS__PROJECTS__SKILLS_22101_2": "Created responsive RWD web pages supporting mainstream social app In-App WebView (e.g., Line, Facebook), writing efficient and maintainable code using SASS (SCSS).",
  "WORKS__PROJECTS__SKILLS_22101_3": "Handled ongoing revisions and feature additions to ensure continuous improvement and optimization.",
  "WORKS__PROJECTS__SKILLS_22101_4": "Collaborated cross-departmentally, participated in full product planning, development, and maintenance.",
  "WORKS__PROJECTS__SKILLS_22101_5": "Participated in team meetings, working with PMs to discuss and push product planning from concept to launch.",
  "WORKS__PROJECTS__SKILLS_22101_6": "Cooperated with back-end engineers on API specification design and integration.",
  "WORKS__PROJECTS__SKILLS_22101_7": "Worked closely with designers to optimize UI/UX, developing based on Sketch and Zeplin design files.",
  "WORKS__PROJECTS__SKILLS_22101_8": "Implemented marketing tracking using Google Analytics and Google Conversion, designing backend tracking rules.",
  "WORKS__PROJECTS__SKILLS_22101_9": "Developed interactive tutorial mini-games to enhance user experience.",
  "WORKS__PROJECTS__SKILLS_22101_10": "Managed shopping cart checkout process and integrated with payment gateway APIs.",
  "WORKS__PROJECTS__SKILLS_22101_11": "Collaborated with front-end team for joint development and problem solving.",
  "WORKS__PROJECTS__TAGS_22101_1": "Nuxt.js (Vue)",
  "WORKS__PROJECTS__TAGS_22101_2": "SASS (SCSS)",
  "WORKS__PROJECTS__TAGS_22101_3": "SEO",
  "WORKS__PROJECTS__TAGS_22101_4": "Google Analytics",
  "WORKS__PROJECTS__TAGS_22101_5": "Google Conversion",
  "WORKS__PROJECTS__TAGS_22101_6": "In-App WebView",
  "WORKS__PROJECTS__TAGS_22101_7": "SSR",
  "WORKS__PROJECTS__TAGS_22101_8": "SEO",
  "WORKS__PROJECTS__NAME_21201": "Bike Lane Map Info Integration (Competition Project)",
  "WORKS__PROJECTS__DATE_21201": "2021",
  "WORKS__PROJECTS__DESCRIPTION_21201": "Provides information on bike station spots and routes across Taiwan, displays available bikes and docks, and presents the data on Google Maps for convenient geographic location services.",
  "WORKS__PROJECTS__SKILLS121201_1": "Developed with Nuxt.js Vue SSR framework, providing high-performance server-side rendering (SSR) solutions.",
  "WORKS__PROJECTS__SKILLS121201_2": "Integrated Google Maps API services, using Maps JavaScript API for map rendering, Distance Matrix API for distance calculations, and customized map styles for enhanced user experience.",
  "WORKS__PROJECTS__SKILLS121201_3": "Used axios to connect to TDX API v2, integrating government Open Data services to provide accurate data queries.",
  "WORKS__PROJECTS__SKILLS121201_4": "Developed responsive RWD web pages, using TypeScript and SASS (SCSS) for maintainable code.",
  "WORKS__PROJECTS__SKILLS121201_5": "This project was submitted as an entry to the <a class=\"cursor-target\" href=\"https://2021.thef2e.com/\" target=\"_blank\">THE F2E 3rd Frontend Bootcamp Competition</a>.",
  "WORKS__PROJECTS__TAGS_21201_1": "Nuxt.js (Vue)",
  "WORKS__PROJECTS__TAGS_21201_2": "Vuex",
  "WORKS__PROJECTS__TAGS_21201_3": "Google Maps API",
  "WORKS__PROJECTS__TAGS_21201_4": "TDX API v2",
  "WORKS__PROJECTS__TAGS_21201_5": "RWD",
  "WORKS__PROJECTS__TAGS_21201_6": "TypeScript",
  "WORKS__PROJECTS__TAGS_21201_7": "SASS (SCSS)",
  "WORKS__PROJECTS__NAME_21202": "Taiwan Travel Attractions Guide (Competition Project)",
  "WORKS__PROJECTS__DATE_21202": "2021",
  "WORKS__PROJECTS__DESCRIPTION_21202": "Integrates recent events, attraction guides, and food stores from all counties and cities in Taiwan, offering users query functions based on filtering criteria.",
  "WORKS__PROJECTS__SKILLS_21202_1": "Developed with Vue.js framework to build dynamic and efficient user interfaces.",
  "WORKS__PROJECTS__SKILLS_21202_2": "Implemented custom carousel image slider and time picker without relying on third-party libraries.",
  "WORKS__PROJECTS__SKILLS_21202_3": "Used axios to connect to TDX API v2 and v3, integrating government Open Data services.",
  "WORKS__PROJECTS__SKILLS_21202_4": "Developed responsive RWD web pages, using TypeScript and SASS (SCSS) for maintainable code.",
  "WORKS__PROJECTS__SKILLS_21202_5": "This project was submitted as an entry to the <a class=\"cursor-target\" href=\"https://2021.thef2e.com/\" target=\"_blank\">THE F2E 3rd Frontend Bootcamp Competition</a>.",
  "WORKS__PROJECTS__TAGS_21202_1": "Vue.js",
  "WORKS__PROJECTS__TAGS_21202_2": "Vuex",
  "WORKS__PROJECTS__TAGS_21202_3": "Google Maps API",
  "WORKS__PROJECTS__TAGS_21202_4": "TDX API v2, v3",
  "WORKS__PROJECTS__TAGS_21202_5": "RWD",
  "WORKS__PROJECTS__NAME_22102": "Tracke (區塊鏈收藏品交易平台)",
  "WORKS__PROJECTS__DATE_22102": "2019~2022 年",
  "WORKS__PROJECTS__DESCRIPTION_22102": "2019 至 2022 年於紫洣科技股份有限公司任職，負責該公司開發的區塊鏈交易平台的前端開發、部分後端 API 撰寫與後台系統開發。參與區塊鏈以太坊智能合約的開發與交易互動撰寫，並開發支持競價拍賣交易、商品展示、商品分類等多種功能。處理競拍同步問題與交易衝突，確保競拍得標並提升整體交易體驗。",
  "WORKS__PROJECTS__SKILLS_22102_1": "進行前端 RWD 開發，支援多裝置顯示需求，確保一致的用戶體驗",
  "WORKS__PROJECTS__SKILLS_22102_2": "開發多語言網站系統，支援國際化與本地化",
  "WORKS__PROJECTS__SKILLS_22102_3": "負責 API 串接與後續維護，並根據需求開發新功能與改版",
  "WORKS__PROJECTS__SKILLS_22102_4": "與後端工程師協作，撰寫 API 並進行資料庫規劃，確保系統的穩定性與可擴展性",
  "WORKS__PROJECTS__SKILLS_22102_5": "負責後台系統的全端開發，提供完整的管理與運營支持",
  "WORKS__PROJECTS__SKILLS_22102_6": "串接第三方區塊鏈錢包，實現與區塊鏈的無縫互動",
  "WORKS__PROJECTS__SKILLS_22102_7": "開發以太坊智能合約並撰寫 Solidity 合約與交易互動 API，支持區塊鏈交易功能",
  "WORKS__PROJECTS__SKILLS_22102_8": "與設計師合作，根據 Sketch 和 Zeplin 設計稿進行前端開發，確保 UI/UX 的優化",
  "WORKS__PROJECTS__SKILLS_22102_9": "參與團隊會議，與 PM 討論技術可行性並規劃開發時程，確保專案順利進行",
  "WORKS__PROJECTS__SKILLS_22102_10": "解決競拍同步問題，處理交易衝突並確保競拍得標，提升交易流程的穩定性",
  "WORKS__PROJECTS__TAGS_22102_1": "Javascript",
  "WORKS__PROJECTS__TAGS_22102_2": "CSS",
  "WORKS__PROJECTS__TAGS_22102_3": "Bootstrap",
  "WORKS__PROJECTS__TAGS_22102_4": "多國語",
  "WORKS__PROJECTS__TAGS_22102_5": "PHP（Laravel）",
  "WORKS__PROJECTS__TAGS_22102_6": "Solidity",
  "WORKS__PROJECTS__TAGS_22102_7": "BlockChain",
  "WORKS__PROJECTS__NAME_25203": "推疊小遊戲",
  "WORKS__PROJECTS__DATE_25203": "2025 年",
  "WORKS__PROJECTS__DESCRIPTION_25203": "復刻小時候摺疊2G手機的小遊戲，獨自規劃全端開發、資料庫規劃，利用美術素材包來製作像素風格的小遊戲，並利用 Matter.js 來實踐真實世界的物理堆疊和重力。<br><span>[此專案還在開發中]</span>",
  "WORKS__PROJECTS__SKILLS_25203_1": "Vue.js 開發",
  "WORKS__PROJECTS__SKILLS_25203_2": "獨自規劃專案架構和 UI/UX",
  "WORKS__PROJECTS__SKILLS_25203_3": "利用 Matter.js 來實做物理世界碰撞、重力和堆疊效果",
  "WORKS__PROJECTS__SKILLS_25203_4": "撰寫 CSS（SCSS）樣式和Typescript",
  "WORKS__PROJECTS__SKILLS_25203_5": "串接 API",
  "WORKS__PROJECTS__SKILLS_25203_6": "Node.js（Express）開發後端 API，mySQL，規劃資料庫設計",
  "WORKS__PROJECTS__TAGS_25203_1": "Vue.js",
  "WORKS__PROJECTS__TAGS_25203_2": "Matter.js",
  "WORKS__PROJECTS__TAGS_25203_3": "Typescript",
  "WORKS__PROJECTS__TAGS_25203_4": "CSS（SCSS）",
  "WORKS__PROJECTS__TAGS_25203_5": "Node.js（Express）",
  "WORKS__PROJECTS__NAME_20201": "旅遊行程安排小工具",
  "WORKS__PROJECTS__DATE_20201": "2020 年",
  "WORKS__PROJECTS__DESCRIPTION_20201": "開發了一款簡單易用的旅遊行程規劃工具，旨在幫助用戶安排旅行計劃。該工具支持多款客製化功能，例如自定義 icon 顯示，並可通過拖放操作輕鬆調整行程順序，無限擴展行程天數。此專案的開發源自個人的痛點，致力於提升用戶在規劃行程過程中的便捷性與靈活性。",
  "WORKS__PROJECTS__SKILLS_20201_1": "從零開始規劃並開發整個專案，涵蓋 UI/UX 設計及前端實現，根據自身需求與痛點開發專案功能",
  "WORKS__PROJECTS__SKILLS_20201_2": "使用 jQuery 進行前端開發，實現互動性強的功能",
  "WORKS__PROJECTS__SKILLS_20201_3": "特別利用 contextmenu、drag、drop 事件來實作拖放與右鍵菜單等自定義操作，提升使用體驗",
  "WORKS__PROJECTS__SKILLS_20201_4": "進行響應式 RWD 網頁開發，並搭配 Bootstrap 實現快速且一致的界面布局",
  "WORKS__PROJECTS__TAGS_20201_1": "Javascript",
  "WORKS__PROJECTS__TAGS_20201_2": "jQuery",
  "WORKS__PROJECTS__TAGS_20201_3": "RWD",
  "WORKS__PROJECTS__TAGS_20201_4": "Bootstrap",
  "WORKS__PROJECTS__TAGS_20201_5": "Font Awesome",
  "WORKS__PROJECTS__NAME_220201": "直播視訊串流",
  "WORKS__PROJECTS__DATE_220201": "2022 年",
  "WORKS__PROJECTS__DESCRIPTION_220201": "開發了一個網頁串流視訊和音訊的專案，使用 navigator.mediaDevices 進行視訊與音訊的串流功能實現，並加入了聊天互動介面。此專案旨在提供一個即時通訊和視訊通話的簡易平台，並透過 GSAP 動畫增強用戶的互動體驗，讓整體操作更加流暢與生動。",
  "WORKS__PROJECTS__SKILLS_220201_": "使用 Vue.js 框架進行前端開發，構建動態且高效的用戶界面",
  "WORKS__PROJECTS__SKILLS_220201_2": "從零到一進行 UI/UX 設計及前端規劃，實現直觀且美觀的使用體驗",
  "WORKS__PROJECTS__SKILLS_220201_3": "進行響應式 RWD 網頁開發，確保在各種裝置上提供一致的用戶體驗",
  "WORKS__PROJECTS__SKILLS_220201_4": "利用 GSAP 實現聊天互動動畫，提升用戶互動的趣味性與流暢度",
  "WORKS__PROJECTS__TAGS_220201_1": "Vue.js",
  "WORKS__PROJECTS__TAGS_220201_2": "RWD",
  "WORKS__PROJECTS__TAGS_220201_3": "navigator.mediaDevices",
  "WORKS__PROJECTS__TAGS_220201_4": "GSAP",
  "WORKS__PROJECTS__NAME_210203": "全台公車動態時刻查詢應用服務（比賽作品）",
  "WORKS__PROJECTS__DATE_210203": "2021 年",
  "WORKS__PROJECTS__DESCRIPTION_210203": "整合全台公車及客運的動態時刻資訊，提供用戶查詢各站點的即時公車及客運運行狀態，並於地圖上顯示各站點的動態站牌。<br>[比賽時間內未完全挑戰成功，功能尚未完整實現]",
  "WORKS__PROJECTS__SKILLS_210203_1": "使用 Nuxt.js Vue SSR 框架開發，實現高效能的伺服器端渲染 (SSR)",
  "WORKS__PROJECTS__SKILLS_210203_2": "使用 axios 串接 TDX API v2，整合政府 Open Data 服務，提供即時數據查詢",
  "WORKS__PROJECTS__SKILLS_210203_3": "進行響應式 RWD 網頁開發，並搭配 SASS (SCSS) 撰寫可維護且高效的程式碼",
  "WORKS__PROJECTS__SKILLS_210203_4": "此專案為參加<a class=\"cursor-target\" href=\"https://2021.thef2e.com/\" target=\"_blank\">「THE F2E 3rd 前端修煉精神時光屋」</a>之比賽作品",
  "WORKS__PROJECTS__TAGS_210203_1": "Nuxt.js (Vue)",
  "WORKS__PROJECTS__TAGS_210203_2": "Vuex",
  "WORKS__PROJECTS__TAGS_210203_3": "RWD",
  "WORKS__PROJECTS__TAGS_210203_4": "TDX api v2",
  "WORKS__PROJECTS__TAGS_210203_5": "SASS (SCSS) ",
  "WORKS__PROJECTS__NAME_220102": "全家超商:智能販賣機",
  "WORKS__PROJECTS__DATE_220102": "2019~2022 年",
  "WORKS__PROJECTS__DESCRIPTION_220102": "2019 至 2022 年於紫洣科技股份有限公司任職，負責販賣機行銷廣告開發，與販賣機廠商合作，實現與實體機台的串接。專案涉及行銷遊戲的討論與研發，並成功應用於全家超商的無人智能販賣機中，提升消費者體驗與互動性。",
  "WORKS__PROJECTS__SKILLS_220102_1": "使用 Vue.js 進行前端開發，實現動態與互動的網頁功能",
  "WORKS__PROJECTS__SKILLS_220102_2": "開發販賣機行銷廣告遊戲，提升用戶互動性和參與感",
  "WORKS__PROJECTS__SKILLS_220102_3": "與廠商合作，利用 Event bus 串接實體販賣機設備",
  "WORKS__PROJECTS__SKILLS_220102_4": "與設計師合作，依照 Zeplin 設計稿進行精確開發，確保界面與設計一致",
  "WORKS__PROJECTS__SKILLS_220102_5": "參與團隊會議，與 PM 一同討論並研發適合販賣機平台的行銷小遊戲",
  "WORKS__PROJECTS__TAGS_220102_1": "Vue.js",
  "WORKS__PROJECTS__TAGS_220102_2": "CSS",
  "WORKS__PROJECTS__NAME_190101": "ALTC (長期照護媒合平台)",
  "WORKS__PROJECTS__DATE_190101": "2018~2019 年",
  "WORKS__PROJECTS__DESCRIPTION_190101": "2019 至 2022 年於紫洣科技股份有限公司任職，負責長照平台的全端開發，依照原有 UI設計和UX 優化開發新功能，並維護舊有系統穩定，負責首頁維護、長照機構媒合、機構資訊展示、表單申請...等功能",
  "WORKS__PROJECTS__SKILLS_190101_1": "PHP (Laravel) 開發SSR全端網站 RWD 響應式網頁",
  "WORKS__PROJECTS__SKILLS_190101_2": "開發新功能及後續維護",
  "WORKS__PROJECTS__SKILLS_190101_3": "資料庫建置規劃，獨立開發",
  "WORKS__PROJECTS__SKILLS_190101_4": "後端的API 撰寫",
  "WORKS__PROJECTS__SKILLS_190101_5": "規劃開發時程與時間分配",
  "WORKS__PROJECTS__TAGS_190101_1": "PHP (Laravel)",
  "WORKS__PROJECTS__TAGS_190101_2": "Javascript",
  "WORKS__PROJECTS__TAGS_190101_3": "Jquery",
  "WORKS__PROJECTS__TAGS_190101_4": "CSS",
  "WORKS__PROJECTS__NAME_190102": "桃園市社會局日照及公托資訊管理系統",
  "WORKS__PROJECTS__DATE_190102": "2018~2019 年",
  "WORKS__PROJECTS__DESCRIPTION_190102": "2019 至 2022 年於紫洣科技股份有限公司任職時開發的日照及公托資訊管理系統，負責開發和規劃整個系統，包含前後端網頁和 APP開發，並與團隊夥伴一同出差到市政府與第一線使用者討論需求和優化 UI/UX。",
  "WORKS__PROJECTS__SKILLS_190102_1": "全端SSR使用C# (.Net Framework)開發，RWD 響應式網頁開發並支援 In-App-Webview",
  "WORKS__PROJECTS__SKILLS_190102_2": "資料庫建置規劃和使用 mySQL",
  "WORKS__PROJECTS__SKILLS_190102_3": "iOS APP 開發使用 Swift 及 APP 介面設計與切圖",
  "WORKS__PROJECTS__SKILLS_190102_4": "與 PM 討論規劃開發時程與時間分配",
  "WORKS__PROJECTS__SKILLS_190102_5": "與其他工程師協作開發",
  "WORKS__PROJECTS__SKILLS_190102_6": "出差到訪客戶參與處理第一線需求",
  "WORKS__PROJECTS__TAGS_190102_1": "C# (.Net Framework)",
  "WORKS__PROJECTS__TAGS_190102_2": "Javascript",
  "WORKS__PROJECTS__TAGS_190102_3": "Jquery",
  "WORKS__PROJECTS__TAGS_190102_4": "CSS",
  "WORKS__PROJECTS__TAGS_190102_5": "iOS APP（Swift）",
  "WORKS__PROJECTS__TAGS_190102_6": "In-App-Webview",
  "WORKS__PROJECTS__TAGS_190102_7": "UI/UX",
  "WORKS__PROJECTS__NAME_190103": "臺中市長期照顧資訊系統",
  "WORKS__PROJECTS__DATE_190103": "2018~2019",
  "WORKS__PROJECTS__DESCRIPTION_190103": "2019 至 2022 年於紫洣科技股份有限公司任職時開發的長照管理系統，負責開發和規劃整個系統，包含前後端網頁和 APP開發，並參與專案壓力測試到上線。",
  "WORKS__PROJECTS__SKILLS_190103_1": "全端SSR使用C# (.Net Framework)開發，RWD 響應式網頁開發並支援 In-App-Webview",
  "WORKS__PROJECTS__SKILLS_190103_2": "資料庫建置規劃和使用 mySQL",
  "WORKS__PROJECTS__SKILLS_190103_3": "iOS APP 開發使用 Swift 及 APP 介面設計與切圖",
  "WORKS__PROJECTS__SKILLS_190103_4": "與 PM 討論規劃開發時程與時間分配",
  "WORKS__PROJECTS__SKILLS_190103_5": "與其他工程師協作開發",
  "WORKS__PROJECTS__TAGS_190103_1": "C# (.Net Framework)",
  "WORKS__PROJECTS__TAGS_190103_2": "Javascript",
  "WORKS__PROJECTS__TAGS_190103_3": "Jquery",
  "WORKS__PROJECTS__TAGS_190103_4": "CSS",
  "WORKS__PROJECTS__TAGS_190103_5": "iOS APP（Swift）",
  "WORKS__PROJECTS__TAGS_190103_6": "UI/UX",
  "WORKS__PROJECTS__NAME_23101": "捲動小遊戲",
  "WORKS__PROJECTS__DATE_23101": "2023",
  "WORKS__PROJECTS__DESCRIPTION_23101": "用 Phaser.js 做的捲動小遊戲",
  "WORKS__PROJECTS__SKILLS_23101_1": "",
  "WORKS__PROJECTS__SKILLS_23101_2": "",
  "WORKS__PROJECTS__TAGS_23101_1": "JavaScript",
  "WORKS__PROJECTS__TAGS_23101_2": "Phaser.js",
  "WORKS__PROJECTS__TAGS_23101_3": "CSS"
}
