{
  "TAB__ALL": "All",
  "TAB__WORK": "Professional Projects",
  "TAB__SIDE_PROJECT": "Side Project",
  "CURSOR__TEXT": "Visit ↗",
  "LOADING__NAME": "ROSE WANG",
  "LOADING__POSITION": "Front-End Engineer / Software Engineer",
  "ABOUT__NAME": "ROSE WANG",
  "ABOUT__POSITION": "Front-End Engineer / Software Engineer",
  "ABOUT__INTRODUCE": "Focused on crafting web experiences with <span>visual appeal and interactive finesse</span>. I transitioned from full-stack to front-end development and bring over 6 years of software development experience. Passionate about blending animations with user experience to create products that balance aesthetics and technology.",
  "ABOUT__SKILLS": "SKILLS",
  "ABOUT__EXPERIENCE": "EXPERIENCE",
  "ABOUT__WORKS": "WORKS",
  "SKILLS__TITLE": "Skills",
  "SKILLS__DESCRIPTION": "Proficient in the Vue.js ecosystem with experience in SSR development using Nuxt.js. Continuously learning front-end technologies such as React.js. Skilled in animation libraries like GSAP and capable with design tools (Figma, Photoshop, Illustrator). Strong full-stack background with experience in PHP, Java, and C#, and hands-on exploration of blockchain by writing and deploying Solidity smart contracts. Experienced in iOS app development and publication, and have built various side projects including Chrome Extensions, LINE LIFF, and Electron.js apps.",
  "SKILLS__ITEMS_1__NAME": "Front-End",
  "SKILLS__ITEMS_2__NAME": "Back-End",
  "SKILLS__ITEMS_3__NAME": "Team Collaboration / Tools",
  "SKILLS__ITEMS_4__NAME": "Other",
  "SKILLS__ITEMS_1__SKILL_1": "<span>Vue.js / Nuxt.js (SSR)</span>",
  "SKILLS__ITEMS_1__SKILL_2": "<span>Pinia / Vuex / VueUse</span>",
  "SKILLS__ITEMS_1__SKILL_3": "<span>RWD / In-APP-Webview</span>",
  "SKILLS__ITEMS_1__SKILL_4": "<span>SASS (SCSS) / Tailwind / BEM</span>",
  "SKILLS__ITEMS_1__SKILL_5": "<span>Javascript / TypeScript</span>",
  "SKILLS__ITEMS_1__SKILL_6": "Cypress",
  "SKILLS__ITEMS_1__SKILL_7": "Vite",
  "SKILLS__ITEMS_1__SKILL_8": "Webpack",
  "SKILLS__ITEMS_1__SKILL_9": "Yarn / bun / npm",
  "SKILLS__ITEMS_1__SKILL_10": "Eslint / Prettier",
  "SKILLS__ITEMS_1__SKILL_11": "SEO",
  "SKILLS__ITEMS_1__SKILL_12": "Electron.js",
  "SKILLS__ITEMS_1__SKILL_13": "LINE Front-end Framework (LIFF)",
  "SKILLS__ITEMS_1__SKILL_14": "Google Chrome Extension",
  "SKILLS__ITEMS_1__SKILL_15": "Element UI",
  "SKILLS__ITEMS_1__SKILL_16": "jQuery / Bootstrap",
  "SKILLS__ITEMS_2__SKILL_1": "<span>Node.js (Express)</span>",
  "SKILLS__ITEMS_2__SKILL_2": "PHP (Laravel)",
  "SKILLS__ITEMS_2__SKILL_3": "mySQL",
  "SKILLS__ITEMS_2__SKILL_4": "API Development",
  "SKILLS__ITEMS_2__SKILL_5": "System & Database Design",
  "SKILLS__ITEMS_3__SKILL_1": "Git (Github / Gitlab)",
  "SKILLS__ITEMS_3__SKILL_2": "<span>Figma</span>",
  "SKILLS__ITEMS_3__SKILL_3": "Zeplin / Sketch",
  "SKILLS__ITEMS_3__SKILL_4": "Jira",
  "SKILLS__ITEMS_3__SKILL_5": "Slack",
  "SKILLS__ITEMS_4__SKILL_1": "Photoshop / Illustrator",
  "SKILLS__ITEMS_4__SKILL_2": "Web3.js / Solidity (Blockchain)",
  "SKILLS__ITEMS_4__SKILL_3": "Phaser.js / Chart.js",
  "SKILLS__ITEMS_4__SKILL_4": "<span>GSAP</span>",
  "SKILLS__ITEMS_4__SKILL_5": "<span>Matter.js</span>",
  "SKILLS__ITEMS_4__SKILL_6": "iOS App (Swift)",
  "EXPERIENCE__TITLE": "EXPERIENCE",
  "EXPERIENCE__DESCRIPTION": "Over 6 years of software development experience, starting as a full-stack developer and gradually focusing on frontend engineering. Skilled in system architecture, cross-functional collaboration, and the Vue.js ecosystem. Participated in large-scale enterprise system maintenance as well as leading end-to-end product development in startup teams. Experienced in both remote and on-site workflows with flexible adaptability to different team environments and requirements.",
  "EXPERIENCE__1__POSITION": "Frontend Engineer",
  "EXPERIENCE__1__COMPANY": "Garena Online Private Limited (Singapore) | 新加坡商競舞電競有限公司",
  "EXPERIENCE__1__PROJECT_1": "Developed promotional sites, registration pages, and interactive in-game web events for top mobile games using Nuxt.js and Vue.js (e.g., Arena of Valor, Moonlight Blade M, Black Clover M).",
  "EXPERIENCE__1__PROJECT_2": "Responsible for frontend system maintenance including performance optimization, RWD, In-App WebView support, SEO integration, and cross-device compatibility.",
  "EXPERIENCE__1__PROJECT_3": "Collaborated with UI/UX, backend, QA, and PM teams to ensure smooth project delivery, covering everything from API integration to technical planning.",
  "EXPERIENCE__1__PROJECT_4": "Handled error monitoring in large-scale environments using Sentry, enabling rapid debugging and hotfix deployment.",
  "EXPERIENCE__1__PROJECT_5": "Enhanced team quality by joining code reviews, developing shared components with Storybook, and writing documentation and project templates.",
  "EXPERIENCE__2__POSITION": "Full-Stack Engineer → Frontend Engineer (Remote)",
  "EXPERIENCE__2__COMPANY": "ZimmTech Co., Ltd. | 紫洣科技股份有限公司",
  "EXPERIENCE__2__PROJECT_1": "Developed both frontend and partial backend for multiple projects including e-commerce platforms, blockchain exchanges, smart vending machines, and admin panels using Nuxt.js, Vue.js, and Laravel (PHP).",
  "EXPERIENCE__2__PROJECT_2": "Researched and built blockchain applications: wrote Ethereum smart contracts (Solidity), created transaction APIs, and integrated Web3.js with wallets.",
  "EXPERIENCE__2__PROJECT_3": "Collaborated with designers using Zeplin and Sketch for UI implementation, adjusted RWD and UX flows based on requirements.",
  "EXPERIENCE__2__PROJECT_4": "Integrated third-party APIs (including payment), set up GA and conversion tracking, and implemented backend analytics logging.",
  "EXPERIENCE__2__PROJECT_5": "Engaged in end-to-end planning, cross-team discussions, and long-term maintenance.",
  "EXPERIENCE__3__POSITION": "Frontend Engineer (Freelance/Remote)",
  "EXPERIENCE__3__COMPANY": "Freelance Projects",
  "EXPERIENCE__3__PROJECT_1": "Handled projects independently: client contracts, requirement interviews, planning, execution, and final delivery.",
  "EXPERIENCE__3__PROJECT_2": "Built custom admin dashboards focusing on frontend UI and business logic implementation.",
  "EXPERIENCE__3__PROJECT_3": "Customized and optimized Google Blogger templates based on client needs.",
  "EXPERIENCE__3__PROJECT_4": "Designed and implemented responsive UI ensuring consistent experience across devices.",
  "EXPERIENCE__3__PROJECT_5": "Worked with backend developers to integrate APIs and handle data interactions.",
  "EXPERIENCE__4__POSITION": "Full-Stack Engineer",
  "EXPERIENCE__4__COMPANY": "Noac Tech Co., Ltd. | 諾亞克科技股份有限公司",
  "EXPERIENCE__4__PROJECT_1": "Developed ERP, long-term care systems, and medical equipment apps for enterprise and clinical applications.",
  "EXPERIENCE__4__PROJECT_2": "Responsible for full-stack tasks including DB design, backend APIs, and frontend pages.",
  "EXPERIENCE__4__PROJECT_3": "Built responsive UIs supporting multi-device experiences.",
  "EXPERIENCE__4__PROJECT_4": "Led technical planning from scratch, handled cross-functional communication, and continued feature optimization.",
  "EXPERIENCE__4__PROJECT_5": "Directly interfaced with clients to translate requirements into technical solutions.",
  "EXPERIENCE__5__POSITION": "Software Development Intern",
  "EXPERIENCE__5__COMPANY": "Cathay Financial Holdings | 國泰金融控股股份有限公司",
  "EXPERIENCE__5__PROJECT_1": "Developed internal backend tools and systems supporting daily operations and workflow improvements.",
  "EXPERIENCE__5__PROJECT_2": "Built and maintained backend modules based on SA/SD task requests.",
  "EXPERIENCE__5__PROJECT_3": "Developed and integrated backend APIs to implement data flow logic.",
  "EXPERIENCE__5__PROJECT_4": "Implemented frontend interfaces and API connections for data interaction features.",
  "EXPERIENCE__6__POSITION": "Bachelor in Information Management | 資訊管理學系 學士",
  "EXPERIENCE__6__COMPANY": "Tunghai University | 東海大學",

  "EXPERIENCE__6__PROJECT_1": "Completed multiple computer science and business-related courses during university, building a solid foundation in programming and logical thinking.",
  "EXPERIENCE__6__PROJECT_2": "Core courses included programming, database design, statistics, discrete mathematics, accounting, information management, and calculus.",
  "EXPERIENCE__6__TAGS_1": "Python",
  "EXPERIENCE__6__TAGS_2": "Java",
  "EXPERIENCE__6__TAGS_3": "JavaScript",
  "EXPERIENCE__6__TAGS_4": "PHP",
  "EXPERIENCE__6__TAGS_5": "C",
  "EXPERIENCE__6__TAGS_6": "C#",
  "EXPERIENCE__6__TAGS_7": "Database Design",
  "WORKS__DEMO_LINKS": "Project Website",
  "WORKS__TITLE": "WORKS",
  "WORKS__DESCRIPTION": "Besides professional development roles, I am passionate about exploring new technologies and transforming real-life pain points into side projects. With backend experience, I can independently complete full-stack development, from UI/UX design to functional implementation, creating projects with technical depth and a great user experience. I have a strong interest in design and visual aesthetics; although not a professional designer, I pay close attention to details and overall visual harmony, aiming to strike the best balance between user experience and visual effects.",
  "WORKS__PROJECTS__NAME_25101": "Game Marketing Website",
  "WORKS__PROJECTS__DATE_25101": "2022–2025",
  "WORKS__PROJECTS__DESCRIPTION_25101": "Worked at Garena Singapore from 2022 to 2025, responsible for developing and maintaining multilingual marketing websites for multiple games. Projects covered main game visuals, pre-registration events, announcements, social sharing, and incorporated interactive visual effects to enhance player engagement. Participated in all stages from requirements discussion, front-end and back-end integration, UI implementation to subsequent maintenance and updates, helping create a website experience with strong brand identity and marketing impact.",
  "WORKS__PROJECTS__SKILLS_25101_1": "Developed marketing websites for games such as 'DeltaForce' and 'Fullmetal Alchemist M'.",
  "WORKS__PROJECTS__SKILLS_25101_2": "Used Nuxt.js (Vue SSR framework) for front-end development, building SEO-friendly and high-performance website architecture.",
  "WORKS__PROJECTS__SKILLS_25101_3": "Implemented responsive RWD pages with modular styles using SASS (SCSS), and introduced TypeScript to improve code stability and maintainability.",
  "WORKS__PROJECTS__SKILLS_25101_4": "Integrated i18n internationalization plugin to support multilingual switching for global users.",
  "WORKS__PROJECTS__SKILLS_25101_5": "Involved in ongoing version maintenance and new feature development to continuously improve user experience and product stability.",
  "WORKS__PROJECTS__SKILLS_25101_6": "Cross-department collaboration: discussed requirements and technical feasibility with international game operations teams and delivered projects according to workflow tickets.",
  "WORKS__PROJECTS__SKILLS_25101_7": "Collaborated with other front-end engineers for development and code review, discussing best implementation practices to continuously optimize code quality and maintain team consistency.",
  "WORKS__PROJECTS__SKILLS_25101_8": "Cooperated with back-end engineers on API design and integration to ensure smooth front-end and back-end data flow.",
  "WORKS__PROJECTS__SKILLS_25101_9": "Worked closely with designers to convert UI designs into code, implementing animation effects and sound trigger logic.",
  "WORKS__PROJECTS__SKILLS_25101_10": "Collaborated with marketing to integrate and configure tracking codes such as GA, Google Conversion, Meta Pixel, and TikTok Pixel.",
  "WORKS__PROJECTS__SKILLS_25101_11": "Cooperated with QA engineers to troubleshoot and optimize issues based on testing feedback, ensuring stable functionality and smooth experience.",
  "WORKS__PROJECTS__SKILLS_25101_12": "Wrote and maintained development documentation to enhance internal team knowledge sharing.",
  "WORKS__PROJECTS__TAGS_25101_1": "Nuxt.js (Vue)",
  "WORKS__PROJECTS__TAGS_25101_2": "Typescript",
  "WORKS__PROJECTS__TAGS_25101_3": "SASS (SCSS)",
  "WORKS__PROJECTS__TAGS_25101_4": "Vite",
  "WORKS__PROJECTS__TAGS_25101_5": "i18n",
  "WORKS__PROJECTS__TAGS_25101_6": "SSR",
  "WORKS__PROJECTS__TAGS_25101_7": "SEO",
  "WORKS__PROJECTS__TAGS_25101_8": "Google Analytics",
  "WORKS__PROJECTS__TAGS_25101_9": "Google Conversion",
  "WORKS__PROJECTS__TAGS_25101_10": "Meta Pixel",
  "WORKS__PROJECTS__TAGS_25101_11": "TikTok Pixel",
  "WORKS__PROJECTS__NAME_25102": "Mobile Game In-App WebView Interactive Pages",
  "WORKS__PROJECTS__DATE_25102": "2022–2025",
  "WORKS__PROJECTS__DESCRIPTION_25102": "Employed at Garena (Singapore) from 2022 to 2025, responsible for developing and maintaining In-App WebView event pages for multiple mobile games. Projects included multilingual support, visual effects, and interactive game designs. Content involved revenue-driven event pages, IP collaborations, in-game event lobbies, tournament pages, and player surveys, helping increase player retention and user engagement.",
  "WORKS__PROJECTS__SKILLS_25102_1": "Developed interactive web pages inside mobile games including 'Arena of Valor', 'Moonlight Blade M', 'Call of Duty: Mobile', 'Black Clover M: Path of the Magic Emperor', 'Dawn Awakening', 'Fullmetal Alchemist M', and others.",
  "WORKS__PROJECTS__SKILLS_25102_2": "Used Vue.js to develop In-App WebView event pages for mobile games, optimized for cross-device compatibility on iOS and Android platforms.",
  "WORKS__PROJECTS__SKILLS_25102_3": "Implemented responsive RWD web pages, modularized styles using SASS (SCSS), and adopted TypeScript to enhance code stability and maintainability.",
  "WORKS__PROJECTS__SKILLS_25102_4": "Integrated i18n internationalization plugin to enable multilingual switching for global users.",
  "WORKS__PROJECTS__SKILLS_25102_5": "Participated in version maintenance and new feature development to continuously improve user experience and product stability.",
  "WORKS__PROJECTS__SKILLS_25102_6": "Collaborated cross-departmentally with multinational game operations teams to discuss requirements and technical feasibility, delivering projects according to task workflows.",
  "WORKS__PROJECTS__SKILLS_25102_7": "Worked with other front-end engineers to develop and conduct code reviews, discussing best practices to continuously optimize code quality and maintain team development consistency.",
  "WORKS__PROJECTS__SKILLS_25102_8": "Collaborated with back-end engineers on API design and integration to ensure smooth data flow between front-end and back-end.",
  "WORKS__PROJECTS__SKILLS_25102_9": "Worked closely with designers to slice UI designs and implement animation effects and sound trigger logic.",
  "WORKS__PROJECTS__SKILLS_25102_10": "Integrated and configured Google Analytics tracking codes in cooperation with the marketing department.",
  "WORKS__PROJECTS__SKILLS_25102_11": "Collaborated with QA engineers to troubleshoot and optimize issues based on testing feedback, ensuring stable functionality and smooth user experience.",
  "WORKS__PROJECTS__SKILLS_25102_12": "Supported hundreds of thousands of players with heavy real-time concurrent browsing and interactions during peak event periods, emphasizing performance and stability in development.",
  "WORKS__PROJECTS__SKILLS_25102_13": "Adopted lazy loading, pagination, and batch request strategies to efficiently optimize data rendering and user operation experience.",
  "WORKS__PROJECTS__SKILLS_25102_14": "Integrated WebSocket real-time connection technology to support live interaction and gameplay mechanics on event pages, enhancing participation and fun.",
  "WORKS__PROJECTS__SKILLS_25102_15": "Wrote and maintained development documentation to improve internal team knowledge sharing.",
  "WORKS__PROJECTS__TAGS_25102_1": "Vue.js",
  "WORKS__PROJECTS__TAGS_25102_2": "Vue3, Vue2",
  "WORKS__PROJECTS__TAGS_25102_3": "TypeScript",
  "WORKS__PROJECTS__TAGS_25102_4": "SASS (SCSS)",
  "WORKS__PROJECTS__TAGS_25102_5": "Vite",
  "WORKS__PROJECTS__TAGS_25102_6": "In-App WebView",
  "WORKS__PROJECTS__TAGS_25102_7": "i18n",
  "WORKS__PROJECTS__TAGS_25102_8": "Google Analytics",
  "WORKS__PROJECTS__NAME_22101": "Leisure Shopping (E-commerce Platform)",
  "WORKS__PROJECTS__DATE_22101": "2019–2022",
  "WORKS__PROJECTS__DESCRIPTION_22101": "Worked at Ziyi Technology Co., Ltd. from 2019 to 2022, responsible for front-end development of the company’s e-commerce platform, covering full site development from scratch to launch and subsequent maintenance. Main tasks included homepage, shopping cart and checkout system, product display, product categorization, promotional activities, and SEO optimization to increase search engine exposure.",
  "WORKS__PROJECTS__SKILLS_22101_1": "Developed with Nuxt.js and Vue SSR framework, providing high-performance server-side rendering (SSR) solutions and optimized SEO for better search ranking.",
  "WORKS__PROJECTS__SKILLS_22101_2": "Created responsive RWD web pages supporting mainstream social app In-App WebView (e.g., Line, Facebook), writing efficient and maintainable code using SASS (SCSS).",
  "WORKS__PROJECTS__SKILLS_22101_3": "Handled ongoing revisions and feature additions to ensure continuous improvement and optimization.",
  "WORKS__PROJECTS__SKILLS_22101_4": "Collaborated cross-departmentally, participated in full product planning, development, and maintenance.",
  "WORKS__PROJECTS__SKILLS_22101_5": "Participated in team meetings, working with PMs to discuss and push product planning from concept to launch.",
  "WORKS__PROJECTS__SKILLS_22101_6": "Cooperated with back-end engineers on API specification design and integration.",
  "WORKS__PROJECTS__SKILLS_22101_7": "Worked closely with designers to optimize UI/UX, developing based on Sketch and Zeplin design files.",
  "WORKS__PROJECTS__SKILLS_22101_8": "Implemented marketing tracking using Google Analytics and Google Conversion, designing backend tracking rules.",
  "WORKS__PROJECTS__SKILLS_22101_9": "Developed interactive tutorial mini-games to enhance user experience.",
  "WORKS__PROJECTS__SKILLS_22101_10": "Managed shopping cart checkout process and integrated with payment gateway APIs.",
  "WORKS__PROJECTS__SKILLS_22101_11": "Collaborated with front-end team for joint development and problem solving.",
  "WORKS__PROJECTS__TAGS_22101_1": "Nuxt.js (Vue)",
  "WORKS__PROJECTS__TAGS_22101_2": "SASS (SCSS)",
  "WORKS__PROJECTS__TAGS_22101_3": "SEO",
  "WORKS__PROJECTS__TAGS_22101_4": "Google Analytics",
  "WORKS__PROJECTS__TAGS_22101_5": "Google Conversion",
  "WORKS__PROJECTS__TAGS_22101_6": "In-App WebView",
  "WORKS__PROJECTS__TAGS_22101_7": "SSR",
  "WORKS__PROJECTS__TAGS_22101_8": "SEO",
  "WORKS__PROJECTS__NAME_21201": "Bike Lane Map Info Integration (Competition Project)",
  "WORKS__PROJECTS__DATE_21201": "2021",
  "WORKS__PROJECTS__DESCRIPTION_21201": "Provides information on bike station spots and routes across Taiwan, displays available bikes and docks, and presents the data on Google Maps for convenient geographic location services.",
  "WORKS__PROJECTS__SKILLS121201_1": "Developed with Nuxt.js Vue SSR framework, providing high-performance server-side rendering (SSR) solutions.",
  "WORKS__PROJECTS__SKILLS121201_2": "Integrated Google Maps API services, using Maps JavaScript API for map rendering, Distance Matrix API for distance calculations, and customized map styles for enhanced user experience.",
  "WORKS__PROJECTS__SKILLS121201_3": "Used axios to connect to TDX API v2, integrating government Open Data services to provide accurate data queries.",
  "WORKS__PROJECTS__SKILLS121201_4": "Developed responsive RWD web pages, using TypeScript and SASS (SCSS) for maintainable code.",
  "WORKS__PROJECTS__SKILLS121201_5": "This project was submitted as an entry to the <a class=\"cursor-target\" href=\"https://2021.thef2e.com/\" target=\"_blank\">THE F2E 3rd Frontend Bootcamp Competition</a>.",
  "WORKS__PROJECTS__TAGS_21201_1": "Nuxt.js (Vue)",
  "WORKS__PROJECTS__TAGS_21201_2": "Vuex",
  "WORKS__PROJECTS__TAGS_21201_3": "Google Maps API",
  "WORKS__PROJECTS__TAGS_21201_4": "TDX API v2",
  "WORKS__PROJECTS__TAGS_21201_5": "RWD",
  "WORKS__PROJECTS__TAGS_21201_6": "TypeScript",
  "WORKS__PROJECTS__TAGS_21201_7": "SASS (SCSS)",
  "WORKS__PROJECTS__NAME_21202": "Taiwan Travel Attractions Guide (Competition Project)",
  "WORKS__PROJECTS__DATE_21202": "2021",
  "WORKS__PROJECTS__DESCRIPTION_21202": "Integrates recent events, attraction guides, and food stores from all counties and cities in Taiwan, offering users query functions based on filtering criteria.",
  "WORKS__PROJECTS__SKILLS_21202_1": "Developed with Vue.js framework to build dynamic and efficient user interfaces.",
  "WORKS__PROJECTS__SKILLS_21202_2": "Implemented custom carousel image slider and time picker without relying on third-party libraries.",
  "WORKS__PROJECTS__SKILLS_21202_3": "Used axios to connect to TDX API v2 and v3, integrating government Open Data services.",
  "WORKS__PROJECTS__SKILLS_21202_4": "Developed responsive RWD web pages, using TypeScript and SASS (SCSS) for maintainable code.",
  "WORKS__PROJECTS__SKILLS_21202_5": "This project was submitted as an entry to the <a class=\"cursor-target\" href=\"https://2021.thef2e.com/\" target=\"_blank\">THE F2E 3rd Frontend Bootcamp Competition</a>.",
  "WORKS__PROJECTS__TAGS_21202_1": "Vue.js",
  "WORKS__PROJECTS__TAGS_21202_2": "Vuex",
  "WORKS__PROJECTS__TAGS_21202_3": "Google Maps API",
  "WORKS__PROJECTS__TAGS_21202_4": "TDX API v2, v3",
  "WORKS__PROJECTS__TAGS_21202_5": "RWD"
}
